update assignment-1
